ashutoshnaveen/lovebox-server/firmware/lovebox_esp32/src/main.cpp
void resetFeedbackState() {
  clearOverlay();
  toolbarVisible = false;
  drawModeActive = false;
  strokeButtonsShown = false;
}// ---------------------------------------------------------------------------
// UI rendering
// ---------------------------------------------------------------------------
void drawButton(const Button& btn, uint16_t bg, uint16_t fg, const char* label) {
  tft.fillRoundRect(btn.x, btn.y, btn.w, btn.h, 3, bg);
  tft.setTextColor(fg, bg);
  tft.setTextSize(2);
  int16_t w = strlen(label) * 12;
  tft.setCursor(btn.x + (btn.w - w) / 2, btn.y + 8);
  tft.print(label);
}

void drawHeartButton(const Button& btn) {
  tft.fillRoundRect(btn.x, btn.y, btn.w, btn.h, 3, ILI9341_RED);
  int cx = btn.x + btn.w / 2;
  int cy = btn.y + btn.h / 2;
  tft.fillCircle(cx - 7, cy - 3, 6, ILI9341_WHITE);
  tft.fillCircle(cx + 7, cy - 3, 6, ILI9341_WHITE);
  tft.fillTriangle(cx - 13, cy - 1, cx + 13, cy - 1, cx, cy + 12, ILI9341_WHITE);
}

void renderUI() {
  if (!toolbarVisible) {
    drawHeartButton(heartBtn);
  }

  if (currentMessageCaption.length() > 0) {
    drawButton(capBtn, captionVisible ? 0x780F : 0x5A69, ILI9341_WHITE, "CAPTION");
  }

  if (!toolbarVisible) {
    // Blue background -> white text
    drawButton(penBtn, ILI9341_BLUE, ILI9341_WHITE, "PEN");
    // Purple/Magenta background -> white text
    drawButton(replayBtn, 0x780F, ILI9341_WHITE, "PLAY");
  } else {
    // Color swatches (active one gets a white outline)
    for (int i = 0; i < SWATCH_COUNT; i++) {
      const ColorSwatch& s = swatches[i];
      tft.fillRect(s.x, s.y, s.w, s.h, s.color);
      if (i == activeColorIndex) {
        tft.drawRect(s.x - 1, s.y - 1, s.w + 2, s.h + 2, ILI9341_WHITE);
      } else {
        tft.drawRect(s.x - 1, s.y - 1, s.w + 2, s.h + 2, ILI9341_BLACK);
      }
    }
    tft.fillRect(0, TOOLBAR_Y, SCREEN_WIDTH, TOOLBAR_H, ILI9341_BLACK);
    if (overlayHasStrokes) {
      // Dark grey background -> white text
      drawButton(clearBtn, 0x5A69, ILI9341_WHITE, "CLR");
      // Green background -> white text
      drawButton(sendBtn, ILI9341_GREEN, ILI9341_WHITE, "SEND");
    }
    // Red background -> white text
    drawButton(closeBtn, ILI9341_RED, ILI9341_WHITE, "CLOSE");
  }
}

void renderScreen() {
  if (!displayStoredImage()) {
    tft.fillScreen(ILI9341_BLACK);
  }
  displayCaption();
  renderUI();
}

void flashRect(const Button& btn) {
  tft.drawRect(btn.x - 2, btn.y - 2, btn.w + 4, btn.h + 4, ILI9341_WHITE);
  delay(120);
  renderUI();
}

void displayCaption() {
  if (!captionVisible || currentCaption.length() == 0) return;
  const int CHAR_W = 6;
  const int LINE_H = 8;
  const int MARGIN_X = 4;
  const int MARGIN_Y = 3;
  const int maxW = SCREEN_WIDTH - MARGIN_X * 2;
  int lines = 1;
  int w = 0;
  for (int i = 0; i < currentCaption.length(); i++) {
    if (currentCaption[i] == '\n') {
      lines++;
      w = 0;
    } else {
      w += CHAR_W;
      if (w > maxW) {
        lines++;
        w = CHAR_W;
      }
    }
  }
  const int capY = 42;
  const int capH = MARGIN_Y * 2 + lines * LINE_H;
  tft.fillRect(0, capY, SCREEN_WIDTH, capH, ILI9341_BLACK);
  tft.setTextColor(ILI9341_WHITE, ILI9341_BLACK);
  tft.setTextSize(1);
  tft.setTextWrap(false);
  tft.setCursor(MARGIN_X, capY + MARGIN_Y);
  tft.print(currentCaption);
}

void showToast(const String& text) {
  toastText = text;
  toastUntil = millis() + 1500;
  tft.fillRect(60, 100, 200, 40, ILI9341_BLACK);
  tft.drawRect(60, 100, 200, 40, ILI9341_WHITE);
  tft.setTextColor(ILI9341_WHITE, ILI9341_BLACK);
  tft.setTextSize(2);
  tft.setCursor(80, 113);
  tft.print(text);
}

void clearToast() {
  if (toastUntil > 0 && millis() > toastUntil) {
    toastUntil = 0;
    renderScreen();
  }
}

// ---------------------------------------------------------------------------
// Touch handling
// ---------------------------------------------------------------------------
void handleTouch() {
  if (!touchReady) return;

  // Poll touched() FIRST: it triggers a fresh XPT2046 read.
  // Calling getPoint() first returns stale coordinates from the previous touch.
  bool isTouched = touch.touched();
  TS_Point p = touch.getPoint();

  if (!wasTouched && isTouched) {
    if (touchUpAt != 0 && millis() - touchUpAt < TOUCH_DEBOUNCE_MS) {
      return;  // Bounce right after release: ignore
    }
    // Contact just began: record sample count, don't trust coordinates yet.
    touchDownSamples = 0;
    touchMoved = false;
    wasTouched = true;
    return;
  }

  if (wasTouched && isTouched) {
    touchDownSamples++;
    if (touchDownSamples < TOUCH_SETTLE_SAMPLES) {
      return;  // Discard noisy early samples while pressure stabilizes
    }
    int x = mapTouchToScreenX(p.x);
    int y = mapTouchToScreenY(p.y);
    if (touchDownSamples == TOUCH_SETTLE_SAMPLES) {
      // First stable sample: anchor the gesture here
      touchStartX = x;
      touchStartY = y;
      touchLastX = x;
      touchLastY = y;
      Serial.printf("touch down: raw=%d,%d screen=%d,%d z=%d\n", p.x, p.y, x, y, p.z);
      return;
    }
    if (abs(x - touchStartX) > 10 || abs(y - touchStartY) > 10) touchMoved = true;

    // Spike rejection: a single wild sample (shared-SPI glitch or pressure
    // flicker) would draw a long stray line. Skip jumps that are physically
    // impossible between two consecutive ~3ms samples.
    if (abs(x - touchLastX) > 60 || abs(y - touchLastY) > 60) {
      Serial.printf("touch spike rejected: %d,%d -> %d,%d\n", touchLastX, touchLastY, x, y);
      return;
    }

    // Light smoothing: average with previous point to reduce jitter
    int sx = (x + touchLastX) / 2;
    int sy = (y + touchLastY) / 2;

    if (drawModeActive && !isInAnyControl(sx, sy)) {
      drawLine(touchLastX, touchLastY, sx, sy);
      // First stroke of the session: reveal CLR/SEND buttons now
      if (overlayHasStrokes && !strokeButtonsShown) {
        strokeButtonsShown = true;
        renderUI();
      }
    }
    touchLastX = sx;
    touchLastY = sy;
    return;
  }

  if (wasTouched && !isTouched) {
    wasTouched = false;
    touchUpAt = millis();
    Serial.printf("touch up: screen=%d,%d moved=%s\n", touchStartX, touchStartY, touchMoved ? "yes" : "no");
    if (!touchMoved && touchDownSamples >= TOUCH_SETTLE_SAMPLES) {
      handleTap(touchStartX, touchStartY);
    }
  }
}

void handleTap(int x, int y) {
  if (!toolbarVisible && isInButton(x, y, heartBtn)) {
    Serial.println("tap: heart");
    flashRect(heartBtn);
    if (sendLikeFeedback()) {
      showToast("Liked!");
    } else {
      showToast("Like failed");
    }
    return;
  }

  if (currentMessageCaption.length() > 0 && isInButton(x, y, capBtn)) {
    Serial.println("tap: caption toggle");
    flashRect(capBtn);
    captionVisible = !captionVisible;
    renderScreen();
    showToast(captionVisible ? "Caption ON" : "Caption OFF");
    return;
  }

  if (toolbarVisible) {
    // Color swatch selection
    for (int i = 0; i < SWATCH_COUNT; i++) {
      const ColorSwatch& s = swatches[i];
      if (x >= s.x && x < s.x + s.w && y >= s.y && y < s.y + s.h) {
        activeColorIndex = i;
        Serial.printf("tap: color %d\n", i);
        renderUI();
        return;
      }
    }
    if (overlayHasStrokes && isInButton(x, y, clearBtn)) {
      Serial.println("tap: clear");
      flashRect(clearBtn);
      clearOverlay();
      renderScreen();
    } else if (overlayHasStrokes && isInButton(x, y, sendBtn)) {
      Serial.println("tap: send");
      flashRect(sendBtn);
      bool ok = sendDrawingFeedback();
      resetFeedbackState();
      renderScreen();
      showToast(ok ? "Sent!" : "Send failed");
    } else if (isInButton(x, y, closeBtn)) {
      Serial.println("tap: close");
      flashRect(closeBtn);
      drawModeActive = false;
      toolbarVisible = false;
      renderScreen();
    }
  } else {
    if (isInButton(x, y, penBtn)) {
      Serial.println("tap: pen");
      flashRect(penBtn);
      // Pen opens drawing mode directly: color bar + immediate drawing
      toolbarVisible = true;
      drawModeActive = true;
      strokeButtonsShown = false;
      renderScreen();
      return;
    }
    if (isInButton(x, y, replayBtn)) {
      Serial.println("tap: replay");
      flashRect(replayBtn);
      showToast("Playing...");
      if (FFat.exists(AUDIO_PATH)) {
        playAudioFile();
      } else {
        playNotificationTone();
      }
      toastUntil = 0;
      renderScreen();
      return;
    }
  }
}

// ---------------------------------------------------------------------------
// Network feedback
// ---------------------------------------------------------------------------
bool sendLikeFeedback() {
  if (lastProcessedId.length() == 0) {
    Serial.println("like feedback: no message id");
    return false;
  }

  String url = String(API_HOST) + "/.netlify/functions/lovebox-feedback?deviceId=" + DEVICE_ID;
  http.begin(secureClient, url);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Feedback-Type", "like");
  http.setTimeout(HTTP_TIMEOUT_MS);

  String payload = "{\"type\":\"like\",\"messageId\":\"" + lastProcessedId + "\"}";
  int httpCode = http.POST(payload);
  http.end();

  Serial.printf("like feedback HTTP %d, id=%s\\n", httpCode, lastProcessedId.c_str());
  return httpCode == 200;
}

bool sendDrawingFeedback() {
  if (lastProcessedId.length() == 0 || !imageStorageReady || !FFat.exists(IMAGE_PATH)) {
    Serial.printf("draw feedback: not ready, id=%s, storage=%s, image=%s\n",
      lastProcessedId.c_str(),
      imageStorageReady ? "yes" : "no",
      FFat.exists(IMAGE_PATH) ? "yes" : "no");
    return false;
  }

  File imageFile = FFat.open(IMAGE_PATH, FILE_READ);
  if (!imageFile || imageFile.size() != IMAGE_SIZE) {
    if (imageFile) imageFile.close();
    return false;
  }

  uint8_t* composed = new uint8_t[IMAGE_SIZE];
  if (!composed) {
    imageFile.close();
    return false;
  }

  if (imageFile.read(composed, IMAGE_SIZE) != IMAGE_SIZE) {
    delete[] composed;
    imageFile.close();
    return false;
  }
  imageFile.close();

