ashutoshnaveen/lovebox-server/firmware/lovebox_esp32/src/main.cpp
  Serial.println("OTA installed; rebooting");
  delay(250);
  ESP.restart();
  return true;
}

// ---------------------------------------------------------------------------
// Setup
// ---------------------------------------------------------------------------
void setup() {
  Serial.begin(115200);
  delay(500);
  Serial.setDebugOutput(true);
  Serial.println("Lovebox boot");
  esp_ota_mark_app_valid_cancel_rollback();

  // TFT setup
  tft.begin();
  displayReady = true;
  tft.setRotation(1);
  Serial.println("TFT initialized");
  tft.fillScreen(ILI9341_BLACK);

  // Touch setup (shared SPI bus with TFT, separate CS).
  // Order matters: configure custom pins first, then touch.begin() attaches
  // its interrupt; the library's internal SPI.begin() keeps existing pin mux.
  SPI.begin(TOUCH_SCK, TOUCH_MISO, TOUCH_MOSI, TOUCH_CS);
  touchReady = touch.begin();
  Serial.printf("Touch ready: %s\n", touchReady ? "yes" : "no");

  // Servo setup
  heartServo.setPeriodHertz(50);
  servoReady = heartServo.attach(SERVO_PIN, 500, 2400) > 0;
  heartServo.write(SERVO_BASE_ANGLE);

  // I2S Audio setup (MAX98357A)
  audioReady = initI2SAudio();
  Serial.printf("Audio ready: %s\n", audioReady ? "yes" : "no");

  showScreen(
    "LOVEBOX",
    "Starting...",
    "Checking Wi-Fi"
  );

  WiFi.mode(WIFI_STA);

  WiFiManager wifiManager;

  wifiManager.setAPCallback(configModeCallback);
  wifiManager.setSaveConfigCallback(saveConfigCallback);

  // Stop waiting forever if setup is abandoned
  wifiManager.setConfigPortalTimeout(180);

  // Useful during development only
  if (ERASE_SAVED_WIFI) {
    wifiManager.resetSettings();

    showScreen(
      "WI-FI RESET",
      "Saved network removed",
      "Restart device"
    );

    delay(3000);
    ESP.restart();
  }

  /*
    Behaviour:
    1. Tries previously saved Wi-Fi.
    2. If none exists or connection fails, creates LOVEBOX-SETUP.
    3. User connects by phone and enters Wi-Fi details.
    4. Credentials are stored automatically.
  */
  bool connected = wifiManager.autoConnect(
    "LOVEBOX-SETUP",
    "lovebox123"
  );

  if (!connected) {
    Serial.println("Wi-Fi setup failed or timed out");

    showScreen(
      "NO WI-FI",
      "Setup timed out",
      "Restart to retry",
      ILI9341_RED
    );

    delay(5000);
    ESP.restart();
  }

  Serial.println("Wi-Fi connected");
  Serial.print("Network: ");
  Serial.println(WiFi.SSID());
  Serial.print("IP address: ");
  Serial.println(WiFi.localIP());

  showScreen(
    "CONNECTED",
    WiFi.SSID(),
    WiFi.localIP().toString(),
    ILI9341_GREEN
  );

  showScreen("STORAGE", "Opening flash...", "");
  prefs.begin("lovebox", false);
  lastProcessedId = prefs.getString("lastId", "");
  currentCaption = prefs.getString("lastCaption", "");
  currentMessageCaption = currentCaption;

  showScreen("STORAGE", "Preparing files...", "");
  imageStorageReady = FFat.begin(true);
  Serial.printf("FFat ready: %s\n", imageStorageReady ? "yes" : "no");
  Serial.printf("Cached image: %s\n", FFat.exists(IMAGE_PATH) ? "yes" : "no");

  // TODO: For production, replace setInsecure with a proper root CA certificate.
  secureClient.setInsecure();

  delay(2000);
  if (FFat.exists(IMAGE_PATH)) {
    Serial.println("Restoring cached image");
    showScreen("STORAGE", "Restoring image...", "");
  }
  if (!displayStoredImage()) {
    // No cached image (fresh FFat format, corruption, or wipe).
    // Clear the stored message ID so the current backend message is
    // re-downloaded instead of being skipped as "already displayed".
    if (lastProcessedId.length() > 0) {
      Serial.println("Cached image missing; clearing stored message ID");
      lastProcessedId = "";
      prefs.putString("lastId", "");
    }
    Serial.println("No cached image displayed");
    showScreen("WAITING", "Waiting for love...", "", ILI9341_PINK);
  } else {
    Serial.println("Cached image displayed");
    resetFeedbackState();
    displayCaption();
    renderUI();
  }

  lastHealthAt = millis();
  sendHealthReport();
}

// ---------------------------------------------------------------------------
// Main loop
// ---------------------------------------------------------------------------
void loop() {
  handleTouch();
  clearToast();

  if (WiFi.status() != WL_CONNECTED) {
    showScreen("NO WI-FI", "Wi-Fi lost", "Reconnecting...", ILI9341_RED);
    WiFi.reconnect();
    delay(5000);
    return;
  }

  if (millis() - lastPollAt >= POLL_INTERVAL_MS) {
    lastPollAt = millis();

    LatestMessage msg = fetchLatestMessage();

    if (msg.valid && msg.id != lastProcessedId) {
      if (downloadAndDisplayImage(msg.imageId)) {
        animateHeart();
        toastUntil = 0;
        lastProcessedId = msg.id;
        currentCaption = msg.caption;
        currentMessageCaption = msg.caption;
        captionVisible = true;
        prefs.putString("lastId", lastProcessedId);
        prefs.putString("lastCaption", currentCaption);
        resetFeedbackState();
        renderScreen();
        sendAck();
        if (msg.audioId.length() > 0) {
          if (downloadAudioFile(msg.audioId)) {
            if (!playAudioFile()) {
              showToast("Audio play failed");
            }
          }
        } else {
          playNotificationTone();
        }
      } else {
        showScreen("OOPS", "Image failed", lastImageError, ILI9341_RED);
        delay(2000);
        renderScreen();
      }
    }
  }

  if (millis() - lastHealthAt >= HEALTH_INTERVAL_MS) {
    lastHealthAt = millis();
    sendHealthReport();
  }

  if (millis() - lastOtaCheckAt >= OTA_CHECK_INTERVAL_MS) {
    lastOtaCheckAt = millis();
    checkForFirmwareUpdate();
  }

  delay(10);
}

LatestMessage fetchLatestMessage() {
  LatestMessage msg = { "", "", "", "", "", false };

  String url = String(API_HOST) + "/.netlify/functions/lovebox-latest?deviceId=" + DEVICE_ID;

  http.begin(secureClient, url);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.setTimeout(HTTP_TIMEOUT_MS);

  int httpCode = http.GET();
  if (httpCode != 200) {
    Serial.printf("latest HTTP %d\n", httpCode);
    http.end();
    return msg;
  }

  lastSuccessfulCommunicationAt = millis();

  String payload = http.getString();
  http.end();

  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, payload);
  if (err) {
    Serial.println("JSON parse failed");
    return msg;
  }

  if (!doc["ok"].as<bool>()) {
    Serial.println("API returned error");
    return msg;
  }

