ashutoshnaveen/lovebox-server/firmware/lovebox_esp32/src/main.cpp
  JsonObject data = doc["data"];
  if (data.isNull()) {
    return msg; // No image yet
  }
  msg.id = data["id"].as<String>();
  msg.imageId = data["imageId"].as<String>();
  msg.audioId = data["audioId"].as<String>();
  msg.caption = data["caption"].as<String>();
  msg.senderName = data["senderName"].as<String>();
  msg.valid = msg.id.length() > 0 && msg.imageId.length() > 0;

  return msg;
}

// ---------------------------------------------------------------------------
// Network: download and display image
// ---------------------------------------------------------------------------
bool downloadAndDisplayImage(const String& imageId) {
  lastImageError = "";
  String url = String(API_HOST) + "/.netlify/functions/lovebox-image?deviceId=" + DEVICE_ID + "&imageId=" + imageId;

  if (!imageStorageReady) {
    lastImageError = "Image storage unavailable";
    return false;
  }

  http.useHTTP10(false);
  http.begin(secureClient, url);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.setTimeout(DOWNLOAD_TIMEOUT_MS);

  int httpCode = http.GET();
  if (httpCode != 200) {
    lastImageError = "HTTP " + String(httpCode);
    Serial.printf("image HTTP %d\n", httpCode);
    http.end();
    return false;
  }

  showScreen("LOVE", "Downloading...", "Please wait", ILI9341_PINK);

  if (FFat.exists("/incoming.rgb565")) FFat.remove("/incoming.rgb565");
  File imageFile = FFat.open("/incoming.rgb565", FILE_WRITE);
  if (!imageFile) {
    lastImageError = "Cannot save image";
    http.end();
    return false;
  }

  int written = http.writeToStream(&imageFile);
  imageFile.close();
  http.end();

  if (written != IMAGE_SIZE) {
    lastImageError = "Received " + String(written);
    return false;
  }

  if (FFat.exists(IMAGE_PATH)) FFat.remove(IMAGE_PATH);
  if (!FFat.rename("/incoming.rgb565", IMAGE_PATH)) {
    lastImageError = "Cannot store image";
    return false;
  }

  showScreen("LOVE", "Displaying...", "", ILI9341_PINK);
  if (!displayStoredImage()) {
    lastImageError = "Cannot read image";
    return false;
  }

  return true;
}

// ---------------------------------------------------------------------------
// Network: acknowledge delivery
// ---------------------------------------------------------------------------
void sendAck() {
  String url = String(API_HOST) + "/.netlify/functions/lovebox-ack?deviceId=" + DEVICE_ID;
  http.begin(secureClient, url);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.setTimeout(HTTP_TIMEOUT_MS);
  http.POST("");
  http.end();
}

// ---------------------------------------------------------------------------
// Network: download and play voice-note audio (16-bit PCM WAV)
// ---------------------------------------------------------------------------
bool downloadAudioFile(const String& audioId) {
  if (!imageStorageReady || WiFi.status() != WL_CONNECTED) {
    Serial.println("audio download skipped: storage/wifi not ready");
    return false;
  }

  String url = String(API_HOST) + "/.netlify/functions/lovebox-audio?deviceId=" + DEVICE_ID + "&audioId=" + audioId;
  http.useHTTP10(false);
  http.begin(secureClient, url);
  http.addHeader("X-Device-Key", DEVICE_KEY);
  http.setTimeout(DOWNLOAD_TIMEOUT_MS);

  int httpCode = http.GET();
  if (httpCode != 200) {
    Serial.printf("audio download failed HTTP %d for %s\n", httpCode, audioId.c_str());
    http.end();
    showToast("Audio download failed");
    return false;
  }

  showToast("Voice note...");

  if (FFat.exists(AUDIO_PATH)) FFat.remove(AUDIO_PATH);
  File audioFile = FFat.open(AUDIO_PATH, FILE_WRITE);
  if (!audioFile) {
    Serial.println("audio file open failed for write");
    http.end();
    showToast("Audio save failed");
    return false;
  }

  int written = http.writeToStream(&audioFile);
  audioFile.close();
  http.end();

  Serial.printf("audio downloaded: %d bytes for %s\n", written, audioId.c_str());
  if (written <= 44) {
    showToast("Audio file too short");
    return false;
  }
  return true;
}

bool playAudioFile() {
  File f = FFat.open(AUDIO_PATH, FILE_READ);
  if (!f) {
    Serial.println("audio play failed: cannot open /audio.wav");
    return false;
  }

  uint8_t hdr[12];
  if (f.read(hdr, 12) != 12 || strncmp((char*)hdr, "RIFF", 4) != 0) {
    Serial.println("audio play failed: missing RIFF header");
    f.close();
    return false;
  }

  uint32_t sampleRate = 16000;
  uint16_t channels = 1;
  uint16_t bits = 16;
  bool foundData = false;
  uint32_t dataSize = 0;

  while (f.available()) {
    uint8_t chunkId[4];
    uint8_t chunkSizeBytes[4];
    if (f.read(chunkId, 4) != 4) break;
    if (f.read(chunkSizeBytes, 4) != 4) break;
    uint32_t chunkSize = chunkSizeBytes[0] | (chunkSizeBytes[1] << 8) |
                         ((uint32_t)chunkSizeBytes[2] << 16) | ((uint32_t)chunkSizeBytes[3] << 24);

    if (memcmp(chunkId, "fmt ", 4) == 0) {
      uint8_t fmt[16];
      if (f.read(fmt, 16) == 16) {
        channels = fmt[2] | (fmt[3] << 8);
        sampleRate = fmt[4] | (fmt[5] << 8) | ((uint32_t)fmt[6] << 16) | ((uint32_t)fmt[7] << 24);
        bits = fmt[14] | (fmt[15] << 8);
      }
      int32_t skip = (int32_t)chunkSize - 16;
      while (skip > 0) {
        uint8_t dump[32];
        int n = f.read(dump, skip > 32 ? 32 : skip);
        if (n <= 0) break;
        skip -= n;
      }
    } else if (memcmp(chunkId, "data", 4) == 0) {
      dataSize = chunkSize;
      foundData = true;
      break;
    } else {
      int32_t skip = (int32_t)chunkSize;
      while (skip > 0) {
        uint8_t dump[32];
        int n = f.read(dump, skip > 32 ? 32 : skip);
        if (n <= 0) break;
        skip -= n;
      }
    }
  }

  if (!foundData || dataSize == 0) {
    Serial.printf("audio play failed: data chunk missing or empty (found=%d size=%u)\n", foundData, dataSize);
    f.close();
    return false;
  }

  Serial.printf("audio playback start: %u Hz, %u ch, %u bit, %u bytes\n", sampleRate, channels, bits, dataSize);

  i2s_set_clk(I2S_NUM_0, sampleRate, (i2s_bits_per_sample_t)bits, I2S_CHANNEL_STEREO);

  const int CHUNK = 1024;
  uint8_t buf[CHUNK];
  static uint8_t stereoBuf[CHUNK * 2];
  uint32_t remaining = dataSize;
  bool mono = (channels == 1);
  size_t bytesWritten = 0;
  const float DIGITAL_GAIN = 1.6f;

