ashutoshnaveen/lovebox-server/firmware/lovebox_esp32/src/main.cpp
  while (remaining > 0) {
    uint32_t toRead = remaining > CHUNK ? CHUNK : remaining;
    int rd = f.read(buf, toRead);
    if (rd <= 0) break;

    if (mono && bits == 16) {
      int samples = rd / 2;
      for (int i = 0; i < samples; i++) {
        int16_t raw = (int16_t)(buf[i * 2] | (buf[i * 2 + 1] << 8));
        int32_t amplified = (int32_t)(raw * DIGITAL_GAIN);
        if (amplified > 32767) amplified = 32767;
        if (amplified < -32768) amplified = -32768;
        uint16_t s = (uint16_t)(int16_t)amplified;
        stereoBuf[i * 4]     = s & 0xFF;
        stereoBuf[i * 4 + 1] = (s >> 8) & 0xFF;
        stereoBuf[i * 4 + 2] = s & 0xFF;
        stereoBuf[i * 4 + 3] = (s >> 8) & 0xFF;
      }
      i2s_write(I2S_NUM_0, stereoBuf, (size_t)samples * 4, &bytesWritten, portMAX_DELAY);
    } else {
      if (bits == 16) {
        int samples = rd / 2;
        for (int i = 0; i < samples; i++) {
          int16_t raw = (int16_t)(buf[i * 2] | (buf[i * 2 + 1] << 8));
          int32_t amplified = (int32_t)(raw * DIGITAL_GAIN);
          if (amplified > 32767) amplified = 32767;
          if (amplified < -32768) amplified = -32768;
          uint16_t s = (uint16_t)(int16_t)amplified;
          buf[i * 2]     = s & 0xFF;
          buf[i * 2 + 1] = (s >> 8) & 0xFF;
        }
      }
      i2s_write(I2S_NUM_0, buf, (size_t)rd, &bytesWritten, portMAX_DELAY);
    }
    remaining -= rd;
    yield();
  }

  f.close();
  Serial.println("audio playback finished");
  return true;
}

bool playNotificationTone() {
  const uint32_t sampleRate = 16000;
  i2s_set_clk(I2S_NUM_0, sampleRate, I2S_BITS_PER_SAMPLE_16BIT, I2S_CHANNEL_STEREO);

  // 4 notes (C5 523Hz, E5 659Hz, G5 784Hz, C6 1046Hz) with smooth decay
  const float frequencies[4] = { 523.25f, 659.25f, 783.99f, 1046.50f };
  const int totalSamples = sampleRate * 0.95f;

  const int CHUNK = 256;
  uint8_t stereoBuf[CHUNK * 4];
  size_t bytesWritten = 0;

  for (int sampleIdx = 0; sampleIdx < totalSamples; sampleIdx += CHUNK) {
    int count = min(CHUNK, totalSamples - sampleIdx);
    for (int i = 0; i < count; i++) {
      int curSample = sampleIdx + i;
      float val = 0.0f;
      for (int n = 0; n < 4; n++) {
        int noteStart = n * (sampleRate * 0.14f);
        if (curSample >= noteStart) {
          float t = (float)(curSample - noteStart) / (float)sampleRate;
          float env = expf(-4.5f * t);
          val += 0.45f * sinf(2.0f * 3.14159265f * frequencies[n] * t) * env;
        }
      }
      val = constrain(val, -0.98f, 0.98f);
      int16_t s = (int16_t)(val * 32000.0f);
      stereoBuf[i * 4]     = s & 0xFF;
      stereoBuf[i * 4 + 1] = (s >> 8) & 0xFF;
      stereoBuf[i * 4 + 2] = s & 0xFF;
      stereoBuf[i * 4 + 3] = (s >> 8) & 0xFF;
    }
    i2s_write(I2S_NUM_0, stereoBuf, (size_t)count * 4, &bytesWritten, portMAX_DELAY);
    yield();
  }
  Serial.println("notification tone finished");
  return true;
}

// ---------------------------------------------------------------------------
// Servo animation
// ---------------------------------------------------------------------------
void animateHeart() {
  moveServo(SERVO_BASE_ANGLE, SERVO_RIGHT_ANGLE);
  moveServo(SERVO_RIGHT_ANGLE, SERVO_BASE_ANGLE);
  moveServo(SERVO_BASE_ANGLE, SERVO_LEFT_ANGLE);
  moveServo(SERVO_LEFT_ANGLE, SERVO_BASE_ANGLE);
}

void moveServo(int fromAngle, int toAngle) {
  int step = (toAngle > fromAngle) ? 1 : -1;
  for (int pos = fromAngle; pos != toAngle; pos += step) {
    heartServo.write(pos);
    delay(SERVO_STEP_DELAY_MS);
  }
  heartServo.write(toAngle);
}

// ---------------------------------------------------------------------------
// I2S Audio initialization (MAX98357A)
// ---------------------------------------------------------------------------
bool initI2SAudio() {
  // Configure I2S for MAX98357A (I2S Philips standard, 16-bit, stereo)
  i2s_config_t i2s_config = {
    .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX),
    .sample_rate = 44100,
    .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
    .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
    .communication_format = I2S_COMM_FORMAT_STAND_I2S,
    .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
    .dma_buf_count = 8,
    .dma_buf_len = 64,
    .use_apll = false,
    .tx_desc_auto_clear = true,
    .fixed_mclk = 0
  };

  i2s_pin_config_t pin_config = {
    .bck_io_num = I2S_BCLK_PIN,
    .ws_io_num = I2S_LRC_PIN,
    .data_out_num = I2S_DIN_PIN,
    .data_in_num = I2S_PIN_NO_CHANGE
  };

  esp_err_t err = i2s_driver_install(I2S_NUM_0, &i2s_config, 0, NULL);
  if (err != ESP_OK) {
    Serial.printf("I2S driver install failed: %s\n", esp_err_to_name(err));
    return false;
  }

  err = i2s_set_pin(I2S_NUM_0, &pin_config);
  if (err != ESP_OK) {
    Serial.printf("I2S set pin failed: %s\n", esp_err_to_name(err));
    i2s_driver_uninstall(I2S_NUM_0);
    return false;
  }

  Serial.println("I2S (MAX98357A) initialized on GPIO 4(LRC), 5(BCLK), 6(DIN)");
  return true;
}
